Revit 2016 API
AreaLoad.Force2 Property
 Returns the three dimensional force applied to the 2nd reference point of the area load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2016. Use ForceVector2 instead.")]
public XYZ Force2 { get; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2016. Use ForceVector2 instead.")> _
Public ReadOnly Property Force2 As XYZ
	Get
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2016. Use ForceVector2 instead.")]
public:
property XYZ^ Force2 {
	XYZ^ get ();
}
Remarks
 The default force unit is kN/m^2 for metric, and ksf for imperial.
See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace